#### StairsTextOrientation Enumeration

---

|  |
| --- |
| See Also |

The options to be used when orienting text annotations relative to stairs.

**Namespace:**   Autodesk.Revit.DB.Architecture
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public enum StairsTextOrientation ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration StairsTextOrientation ``` |

| Visual C++ |
| --- |
| ``` public enum class StairsTextOrientation ``` |

# Members

| Member name | Description |
| --- | --- |
| Horizontal | Indicator text will be displayed horizontally. |
| Vertical | Indicator text will be displayed vertically. |

# See Also

Autodesk.Revit.DB.Architecture Namespace